the
of
given
return
a
is
and
in
an
to
that
are
you
if
array
integer
number
where
be
it
each
can
for
all
n
1
with
two
from
or
any
there
0
one
at
not
by
such
string
as
integers
order
have
example
on
following
length
nums
-
i
same
no
this
x
has
will
0-indexed
only
minimum
2
maximum
may
note
value
k
ith
after
answer
sum
than
possible
equal
some
s
its
which
between
elements
then
should
must
true
first
every
binary
also
otherwise
we
positive
more
find
characters
so
-1
strings
represents
into
left
exactly
values
3
list
false
other
right
element
m
them
nodes
tree
index
empty
times
your
contains
least
both
most
size
ie
int
time
2d
j
row
different
they
make
node
representing
valid
b
numbers
choose
sequence
multiple
when
their
exists
letters
character
root
either
words
result
arrays
7
write
unique
does
operation
represented
column
do
once
smallest
matrix
sorted
distinct
non-empty
indices
query
move
three
consisting
another
cannot
type
consists
digits
grid
want
adjacent
total
position
initially
key
class
operations
returns
numsi
format
contiguous
implement
using
arr
less
without
within
name
indicates
large
since
these
starting
109
range
new
4
largest
modulo
but
5
defined
start
contain
need
path
set
last
considered
c
lowercase
table
containing
next
take
object
pair
greater
substring
before
generated
subarray
initializes
second
inclusive
cell
target
even
above
denotes
end
form
original
remaining
remove
difference
function
primary
single
letter
sql
schema
word
y
called
guaranteed
numbered
edges
longest
up
edge
means
english
get
use
respectively
until
conditions
input
consecutive
allowed
connected
test
strictly
rules
cells
non-negative
digit
point
id
moves
labeled
change
current
pairs
cases
reach
however
leading
subsequence
while
because
needed
points
always
follows
exist
score
add
assume
product
design
answers
space
6
four
step
numsj
distance
was
ai
starts
steps
could
group
formed
deleting
graph
used
top
appear
day
perform
way
positions
void
amount
replace
9
would
bi
10
possibly
represent
very
t
game
returned
num
case
down
square
queries
answeri
edgesi
changing
formally
zero
data
1s
resulting
who
many
nums1
notice
whose
increasing
ascending
xi
undirected
varchar
rows
becomes
absolute
algorithm
person
output
part
numslength
ways
jth
present
linked
d
zeros
appears
takes
substrings
below
pick
lexicographically
structure
0s
place
smaller
ends
head
delete
been
impossible
itself
previous
still
final
task
required
turn
nums2
line
about
8
non-decreasing
through
yi
arri
r
removing
like
including
solution
complete
count
common
null
direction
odd
initial
performing
call
made
swap
directly
split
children
among
how
moving
good
subarrays
alice
corresponding
consider
process
accepted
cost
separated
val
shortest
none
price
32-bit
go
determine
chosen
types
search
according
let
height
information
report
kth
bottom
decimal
ordered
representation
z
except
palindrome
applying
too
groups
become
along
color
reverse
divisible
divide
out
being
satisfies
spaces
placed
convert
problem
permutation
people
level
----------------------
city
whether
equals
actual
removed
define
already
alphabet
average
goal
bob
1-indexed
date
written
wants
boolean
coordinates
infinite
optimally
apply
highest
abc
solve
p
ab
shown
entire
occurs
prefix
occurrences
ones
uppercase
area
long
plane
playing
code
days
queriesi
child
lengths
leaf
currently
negative
occurrence
paths
during
board
obtain
keys
minutes
turns
were
pass
obtained
derived
over
parent
added
sort
traversal
water
simultaneously
subsequences
play
player
those
insert
parentheses
l
special
third
construct
repeat
interval
system
lower
necessarily
trees
never
build
u
ans
bitwise
duplicate
together
si
complexity
back
seconds
duplicates
subset
travel
squares
check
connecting
constraints
10-5
user
outside
beginning
100
taken
lists
know
described
suppose
tie
names
select
customer
needs
forward
players
money
arranged
lowest
fit
corner
concatenation
unit
e
concatenated
subtree
said
o
choosing
side
just
instead
rearrange
relative
he
11
front
changed
leftmost
columns
directions
calls
built-in
item
stones
frequency
visit
correct
see
extra
functions
calculate
satisfy
employee
visited
xor
flip
ansi
bits
assigned
twice
s1
s2
rectangle
rotate
replacing
map
put
partition
based
larger
results
maximize
endi
starti
consist
east
addition
please
bottom-right
inside
found
create
describes
------------------------
again
invalid
vertical
mat
available
width
n-1
road
meaning
standing
under
ids
receive
bit
fewer
signed
greatest
divided
several
mentioned
adds
adding
text
arr1
top-left
filled
followed
v
students
stop
assign
located
denote
prices
maximized
done
full
rounded
closest
follow
arrj
continue
vi
ui
random
passed
floor
occur
per
method
arrlength
colors
student
modify
location
items
achieve
power
properties
1st
places
upper
nth
denoting
bst
coordinate
stone
nums0
division
units
minute
certain
expression
weight
finish
longer
sentence
12
subtract
minimized
pattern
buy
costs
fits
rotation
might
exceed
state
nums1i
land
4-directionally
backward
horizontal
prime
rest
gets
employees
stops
divisor
pointsi
assuming
numsk
repeated
append
depth
similarly
immediately
reads
friends
fn
modified
col
run
clockwise
wordsi
match
leave
increment
ending
specific
non-overlapping
circular
merge
customers
calculated
his
removes
remains
box
increase
x-axis
west
vertices
wins
arr0
trailing
wall
network
users
counted
differ
palindromic
meets
include
friend
middle
deleted
sign
rearranging
cover
store
reaches
ri
rightmost
walk
minimize
version
diagonal
intervals
moment
round
ordering
keep
permutations
x1
north
south
nearest
around
-----------------------
vertically
higher
123
company
applied
sums
file
additional
replaced
dictionary
1000
asked
encoded
room
covered
now
share
repeating
begin
events
event
seats
inserted
runs
neighbors
going
instance
condition
destination
wait
onto
sequences
jump
directed
h
win
rule
foreign
o1
concatenating
examples
denoted
alternating
inputs
2nd
3rd
limit
cities
scores
performed
hold
gridij
created
rooted
cycles
making
f
included
well
latest
white
sell
holds
25
center
our
13
additionally
base
seat
probability
red
inserts
belongs
lefti
constructed
changes
salary
pile
piles
2n
stream
horizontally
blue
colored
rotated
program
pointer
circle
zeroes
request
building
plus
continuous
high
leaves
robot
etc
queue
solutions
having
speed
belong
rectangular
degrees
image
matches
transform
w
non-zero
open
specifically
orders
card
pay
randomly
singly
righti
word1
word2
boxes
earliest
pricei
overlap
x2
x-y
stack
products
due
shows
-------------------
what
constant
supports
played
off
meet
bidirectional
accepts
transactions
lexicographical
subtrees
userid
mark
series
nothing
completely
-x
tasks
flips
she
associated
hand
five
requirements
mapping
26
0th
read
serialization
similar
bank
much
candies
free
segment
profit
stock
say
course
intersection
reorder
traveling
dollars
insertion
identical
later
capacity
y1
top-right
axis-aligned
a2
rank
swapping
winner
decide
notes
low
work
car
arithmetic
heights
year
triplets
nums2i
uses
had
suffix
leetcode
started
stay
received
placing
piece
slength
num2
num1
sorting
ranges
implementation
cards
enter
subsets
decreasing
modifying
deletion
manner
sets
support
lets
90
rearranged
swaps
abcde
coins
pieces
grouped
timei
comes
rotating
bool
block
pricesi
231
explanation
indicate
hours
rounds
collect
remain
earlier
parts
beautiful
arr2
rectangles
bottom-left
house
push
arbitrary
a1
indicating
satisfied
break
themselves
vertex
update
across
reversed
operator
taking
radius
arrarrlength
makes
choice
numsi1
hour
period
figure
15
subsequent
shift
vice
versa
answerlength
weights
overlapping
decided
language
roads
anywhere
stored
half
multiply
composed
memory
labels
combination
concatenate
message
in-place
recall
happens
significant
queriesj
courses
sold
costi
segments
cycle
black
future
nodeval
whole
intervalsi
video
come
indexed
checks
double
amongst
brackets
own
distribute
descendant
ancestor
arrive
parallel
houses
alices
pop
frequent
particular
running
enum
shape
toi
fromi
weighted
happy
chooses
decrease
balanced
picked
regardless
obstacle
tasked
finally
evaluate
preorder
garden
help
forms
requests
server
strs
chessboard
descending
thus
label
4th
source
sides
provided
abcd
formatted
divides
tasksi
andor
factor
tile
previously
expressions
cut
island
repeatedly
give
olog
1th
public
testcases
g
absx
nums2j
cardinal
boundary
manager
team
perfect
bag
draw
movement
blocks
intersect
divisors
mean
hhmm
completed
logs
food
sit
methods
occupied
surrounded
inserting
321
definition
selected
y2
street
stonesi
earn
pushes
triangle
record
missing
ensure
productid
fixed
closed
world
centered
trying
best
doing
21
multiplied
20
vowel
combinations
copy
disjoint
far
fully
anagram
equivalent
independent
multiplication
operators
able
querieslength
underlined
factors
contained
marked
judge
equally
country
increases
parents
necessary
balls
towards
c1
li
lie
loses
converted
opposite
broken
101
obstacles
ignored
arrk
excluding
maximal
individually
evaluates
affect
weighti
field
kind
collection
01
sequentially
print
forming
roots
replacement
symbol
subtraction
goes
here
ci
rooms
persons
candy
job
small
endpoints
transaction
lines
separate
finished
counts
reset
rating
perimeter
descendants
wikipedia
q
satisfying
workers
waiting
met
worker
arrival
hi
0000
132
stores
absi
non-increasing
timestamp
-------------------------
website
cols
facing
visits
reports
us
handle
generates
reachable
lose
22
answer1
answer0
else
flipping
-3
threads
executed
generate
drop
trip
transformation
differs
reconstruct
alternate
calendar
30
1234
pivot
104
social
tiles
corresponds
exact
vowels
servers
nor
content
compute
encoding
typed
real
eat
jumps
aa
reference
doesnt
ball
fall
falls
simple
fourth
23
reached
passes
did
returning
variable
counterclockwise
exam
others
toward
idi
evenly
sitting
her
positioned
allows
age
uj
vj
runtime
access
addint
calling
accounts
competition
various
formula
sizes
removal
50
instances
minimal
ace
existing
counting
spend
downward
median
decode
allocate
maps
duration
60
numeric
internal
locations
answerj
address
border
library
shop
away
huge
straight
property
log
painted
treat
station
computed
teams
repeats
lead
allow
valuesi
bus
arrives
16
writing
percentage
freely
pilesi
pushint
partitions
varying
updates
wrong
beauty
diagonally
department
decoded
secret
bi-directional
quantity
customerid
moved
guess
fill
partitioned
procedure
constructor
continues
sentences
thread
tests
tokens
cars
enough
prerequisites
evaluation
leaving
differences
permi
perm
i1th
plant
linear
frequencies
media
shorter
chunk
gain
puzzle
splitting
buildings
wrapping
calculates
container
send
indirectly
sent
consecutively
unknown
walls
unless
limited
neighboring
neither
interpreted
school
shares
forever
bags
opening
parenthesis
stand
mountain
cant
computer
likely
solutionint
merged
triplet
connects
chose
appended
r1
meeting
keyboard
c2
printed
numi
yj
milliseconds
05
00
coin
inclusively
pairsi
successful
cause
proven
wi
phone
shapes
nice
green
converting
nested
matching
him
expected
custom
ended
positioni
deletions
employeeid
immediate
works
describe
alphabetically
endpoint
automatically
threshold
objects
outgoing
anagrams
temperature
distances
knows
bc
domino
shifting
produce
collected
nesting
palindromes
built
increments
indexing
frog
removals
simply
symbols
applies
40
bar
overall
mapped
serialized
section
window
heighti
partitioning
indicesi
--
nums1length
walking
component
causes
unfortunately
quality
api
gives
integral
seq
root-to-leaf
diagonals
diagram
outer
attack
restaurant
alphabetical
entries
balloon
keeping
happen
direct
passengers
lost
aforementioned
yields
y-axis
counter-clockwise
bobs
question
slots
unlock
unable
numsleft
numsright
xth
minus
activity
whenever
compared
themself
error
status
regular
partial
neighbor
recursively
languages
beyond
deletes
representations
disturbing
composition
includes
kinds
011
reduce
hello
route
magic
token
trips
planted
criteria
month
coming
dates
pathsi
numsn
endtime
periods
starttime
specified
chunks
capital
14
19
therefore
arrows
components
sale
optimal
simplified
shifts
messages
processed
idle
passing
blocked
infected
-231
environment
look
games
instructions
calculation
disconnected
supply
alphanumeric
banned
connection
connections
conversion
apple
begins
sj
journey
finding
infinitely
arrange
decrement
security
attend
preceding
numsnumslength
alength
standard
0100
010
candidates
pi
2359
24-hour
robots
face
euclidean
usual
yellow
mod
rowi
daily
complement
allocated
email
dot
valuei
planning
matter
turned
paint
phrase
logsi
aj
further
x-coordinate
ignoring
office
train
nary-tree
n-ary
emails
colorsi
fnarri
degree
delivery
try
rearrangement
hidden
travels
intermediate
orderdate
determined
provide
xn
lodashs
2s
account
considering
splits
grow
islands
f1
remember
roadsi
balance
itemsi
generator
dropped
view
i-th
rangesi
rotations
ranks
skip
undefined
ranging
accept
traverse
folder
respective
simplicity
parameter
named
0-based
causing
parenti
nine
500
27
seven
strange
costsi
desired
instantaneously
encode
photo
two-dimensional
refer
attributes
besides
signifies
17
initialized
choices
records
nums2length
bad
selling
discount
lies
spell
online
continuously
happened
float
display
track
traveled
stations
rate
picks
passenger
nobody
receives
finds
repetition
ki
occurring
cross
crosses
river
buses
baskets
basket
clear
questions
constructs
b2
amounts
quantities
distribution
rolls
roll
market
machine
activities
spiral
boundaries
shuffled
an-1
a0
anything
actually
appends
acyclic
resultant
reaching
topmost
135
ties
close
110
-2
separating
triple
though
scheduled
routes
via
0-9
kilometers
flowers
pyramid
sk
belonging
relationship
trivially
ten
meetings
engage
ugly
labelled
enhances
known
net
pressed
endtimei
starttimei
actions
recover
night
shared
regions
star
login
eight
knight
files
terms
arr1i
arr2j
recent
2-dimensional
reduces
unlimited
numerical
--------------------------
treated
ratio
rectanglesi
jumping
legal
hasnext
arguments
critical
diff
nums3
deepest
summation
wordslength
xy-plane
keeps
stick
s3
queens
ever
r2
getint
candiesi
non-space
yyyy-mm-dd
dots
postorder
abcc
xj
dashes
resolve
acb
title
heightsi
bitwise-xor
vali
234
collide
unrooted
n2
die
command
origin
decreases
a3
appending
blank
aaa
restrictions
strength
constraint
equation
booking
bookint
successfully
ranking
better
coli
resulti
wordsj
session
distancei
acceptable
execute
listed
domain
local
tower
preferred
rob
xs
buffer
searchword
axes
cuts
counter
behind
eats
eating
details
iterator
tells
y-coordinate
furthermore
dist
appeared
leetcodecom
vals
valsi
unoccupied
startpos
wide
seatsi
interface
pointers
script
possibilities
statement
variables
compressed
arrangement
lying
configuration
ability
participating
tournament
picking
1n
grid00
gridm
double-ended
deque
mathematical
key-value
recursive
hamming
main
erasing
fibonacci
insertint
interested
productname
temperatures
optionally
colori
throws
180
few
positionsi
finishing
arrivali
k-1
dominoes
startvalue
imagine
i0
i1
sometimes
videos
adjacency
spread
graphij
comprise
manhattan
numcourses
prerequisitesi
vpss
deptha
depthb
maxdeptha
depths
vps
fx
list1
list2
contest
obtaining
xy
held
visiting
signal
callback
folders
whitespace
floors
sub-arrays
compare
001
gridrc
jobs
lands
reformat
filling
inorder
zigzag
fraction
paired
paper
finishes
speedi
root1
root2
project
numsl
working
denominations
principle
numerals
six
correspond
context
teacher
06
tickets
buying
1-9
solving
dont
dimensions
stacked
assumed
1-based
cellsi
gridrowcol
matij
bought
designed
covers
involving
backwards
powers
targetsum
press
requires
ring
aligned
effect
24
conflict
contents
--------------------
bounds
balloons
checked
t2
t1
bound
bracket
income
mini
distributed
dollar
everyone
partially
iterates
iteration
2k
keysi
warehouse
crossing
old
catch
managerid
managers
lock
dead
stacks
312
structurally
valued
dice
6-sided
fair
vice-versa
factory
eventually
comprises
averages
loss
uncolored
giving
numarray
numarrayint
sumrangeint
implemented
testing
len
tell
guarantee
retrieves
34
aec
matrixs
big
objective
1101
foo
wish
upcoming
preparing
ancestors
subgrid
drive
drives
violating
plots
plot
wordlist
relations
prerequisite
non-leaf
evaluating
commas
serialize
contrast
successive
wonderful
monotone
28
flower
unchanged
pref
59
tweets
listinteger
tweet
10000
lucky
findint
occupies
solved
traversing
entirely
offers
reminder
2-d
unsorted
reply
sends
elapsed
arriving
sub
region
reversing
64-bit
unsigned
calculations
divisibility
amounti
device
logged
someday
chess
info
directory
reading
levels
feed
subjected
fuel
destroyed
distributions
closing
movie
movies
referred
5th
determines
connectionsi
nums1j
absnumsi
gcdx
avoid
whereas
existed
plants
shot
sticks
visible
chain
swapped
libraries
s0
locked
pairings
submatrix
mouse
singly-linked
half-open
meetingsi
spanning
corners
max
staircase
unused
ip
addresses
255
seqlength
seqi
col2
excel
sheet
row2
row1
col1
afterward
numsk-1
--------------------------------------
cab
asyncronous
merging
parentsi
subgraph
expansion
mm
val2
val1
sliding
climb
restriction
service
booleans
x0
boardrc
ladder
obstaclesi
unary
attain
weightsi
peoplei
bbb
75
volume
getting
cpu
success
difficulty
coefficient
implementing
depending
pointing
bsts
worst
bricks
erase
pushed
shuffling
tuples
buckets
magical
quadruplets
execution
reject
executing
experience
105
members
member
carpetlen
password
eventsi
poor
live
cubes
flight
guards
captured
rear
isempty
normal
isfull
arr1length
parser
deserialize
deserialized
action
p1
angles
p2
-9
putint
frequently
updated
cj
precedence
run-length
preserving
cousins
disti
ride
in-order
graphs
truncate
expectednumslength
assertions
assert
expectednumsi
expectednums
evaluated
fruits
lexicographic
bef
marks
edgesj
judged
requirement
asks
filetxt
liters
bac
hire
paid
odd-indexed
even-indexed
years
departmentid
departments
robber
stashed
1100
individual
case-sensitive
converts
inputoutput
pays
viewed
worked
queen
placement
non-intersecting
connect
instruction
startrow
height-balanced
widths
xi1
submatrices
drawing
simulate
deeply
json
jsonparse
dies
timesi
factorial
selecting
targets
occupy
stays
cd
extended
res
forgot
delay
link
formats
elevation
flatten
102
sales
aba
force
sn
profiti
getrandom
12345
arrleftright
2h
rides
transferred
typei
gridi
eee
rightward
relation
wooden
ant
energy
load
expressed
angle
browser
tag
floating
words1
words2
labelsi
lower-case
halves
agesi
ages
targety
targetx
university
abcdefghijklmnopqrstuvwxyz
guesses
guessed
relationships
equationsi
equations
ranksi
hands
yourself
copies
reordered
nums2i1
ik
gcd
typing
examine
malware
minitial
cherries
blength
answersi
deck
decki
triangular
patterns
obeys
a4
wasted
init
ccc
f2
f3
specify
4237214
242
274
powx
replaces
viewing
half-closed
delayed
sij
layers
layer
cyclic
preserved
signs
communicate
sure
opponents
sections
biginteger
namesi
reuse
left-to-right
tallest
forest
sub-array
salaries
parameters
contact
alerting
police
typically
clock
maximizes
respect
restricted
flipped
unlocks
entering
graphi
enters
movements
fifth
flattened
painting
2020
matrices
touches
slices
ingredients
owner
uncommon
apples
numsr
assignment
show
pos
fractional
losing
touching
customersi
uniquely
well-formed
---------------------------
chars
indexi
driving
str2
str1
cutting
denominator
falling
aab
32
upper-case
eaten
notation
identify
assigning
2th
frogs
mixed
successor
concept
parent0
xx
ix
iiii
iv
numeral
xxvii
usually
xii
roman
ii
900
400
s1i
printer
cream
ice
bars
boy
summer
downwards
a-z
kjf
grouping
aajf
11106
bijection
ticket
ticketsi
song
songs
timej
topleft
bottomleft
sub-grid
isleaf
sub-grids
recurse
quad-tree
proper
topright
wiki
terminator
bottomright
widthi
mutate
roomsi
personid
classes
page
puts
3x
isnt
rootval
rings
align
dial
metal
keyi
button
spelling
durationi
enemy
attacking
maintain
attribute
pid
restaurants
numerically
burst
bursting
consistent
soldiers
ratingi
subordinates
indirect
importance
maxi
growing
trim
trimmed
sleftirighti
peak
ij
213
differing
lca
decrypt
decrypted
permitted
efficient
efficiency
waits
departs
departure
meters
housesi
fs
percent
slot
wheel
displays
turning
b1
ascii
gap
updateint
incorrect
recorded
machines
processes
activitytype
matrixrowcol
got
duplicated
originally
node2
node1
cipher
transformed
an-2
numsindex
shouldnt
uniform
backspace
non-digit
numsnumslength-1
345
outcome
lot
invert
modifies
separation
triples
situated
dag
tripsi
inverse
farmland
tuesday
sunday
monday
week
beginword
endword
skipped
strategy
smart
party
vote
-k
comma-separated
non-null
ycenter
circumference
xcenter
non-equal
-7
separately
31
pairwise
gardens
120
freq
210
monitor
exchange
contaminated
stocks
cinema
33
reserved
1d
18
speciali
transfers
reside
requestsi
transfer
piecesi
presses
newly
tested
independently
buttons
shiftsi
shifta
images
-10
addnumint
instantly
gone
processing
master
arrived
drawn
install
spreads
spreading
installed
uninfected
resources
installing
batch
deviceid
playerid
gamesplayed
logging
eventdate
sequential
uniformly
stopped
attempts
inner
instructed
performs
anti-clockwise
stands
extending
post
tweetid
news
followerid
creating
smash
fi
case-insensitive
cookies
abcba
odd-numbered
describing
extract
preference
queues
studentsj
prefers
everybody
identified
orange
collecting
mine
gold
6th
minimizes
optimize
exceeding
pig
nums2i2
fulfilled
award
late
absent
attendance
eligible
maxtime
fee
108
lakes
flood
penalty
refill
plantsi
watering
primes
super
flat
arrow
diameter
awesome
arrangements
x3
n-queens
hash
removekey
0110
foods
yes
cat
tracks
laser
plan
interfere
join
firsti
frame
dropping
shaped
hits
spans
incomplete
doubly
layout
targeti
02
19216811
worth
pointslength
defines
convenience
natural
1010
genetic
space-separated
polygon
convex
triangles
rational
hh
coprime
limitj
repaired
repair
limits
rollsi
coinsi
url
short
nums0i
i-1th
simulates
curr
snake
commands
squared
distributing
carry
carries
skills
skill
someone
025
serve
stamps
single-threaded
stopping
ratings
strengths
excluded
cups
quarter
cup
liquid
glass
1001
fizzbuzz
buzz
fizz
mass
category
selection
73
ranked
tank
gas
erased
disappear
brick
popped
asteroids
asteroid
collisions
active
fed
bucket
numsd
numsb
numsc
numsa
entrance
exit
executes
promises
promise
pending
pool
matrixij
studentid
subject
subjects
pascals
alphabetic
family
parents0
mid
capitalization
picky
book
favorite
tilesi
computing
xxxx
weak
strong
transactionsi
allotted
surface
startj
flights
cheapest
numsk1
numsn-1
robbing
capture
os
bulbs
pushing
programming
fifo
fresh
rotten
boomerang
arr2length
bill
90-degree
-5
si1
cache
invalidate
recently
incremented
maintained
innermost
holding
bj
likes
sourcei
yet
effective
quote
nextint
3n
bomb
ignore
completing
floating-point
treesi
farthest
mail
landing
majority
punctuation
removeduplicatesnums
kept
lined
filtering
exclusive
colj
guarded
rowj
quotation
slash
bacd
cloned
fruitsi
vyz
abcdefuvwxyz
bonus
solvable
attempt
populate
struct
0124567
4567012
liter
miles
stationsi
multiplicity
2x
term
orderid
related
45
provides
pixels
kingdom
weakest
army
spellchecker
categories
operates
copied
deep
ground
skyline
57
citys
contour
capacities
rope
proved
costij
matched
training
index2
index1
startcol
advances
permute
fibonacci-like
xi2
ansj
partner
took
tries
cartesian
e1
union
e2
rx
resets
peekpop
supported
natively
movecost
eval
calculator
retrieve
numrows
birth
marking
older
king
death
votes
tied
memoized
cached
stonevalue
012
seed
definitely
systems
resolved
expiration
unrevealed
revealed
mines
a-b
afterwards
planting
bloom
potentially
totally
non
countint
f0
app
treenode
reconstructed
transmitted
serializationdeserialization
optional
trap
raining
pre-order
223
prepending
cook
80
collects
buyerid
2019
sellerid
rook
bishop
bishops
rooks
idx
dividing
taxi
driver
peek
doctors
groupi
save
parsed
warmer
selldate
lcp
wordjn-1
aaca
wordin-1
aabd
lcpij
travelleddistance
enjoy
enjoyyourcoffee
coffee
ideab
ideaa
naming
ideas
transactedon
transid
pseudo-critical
mst
msts
rulevalue
rulekey
namei
bcosti
acosti
flying
interview
fly
gridin
1e-5
succprobi
throwing
threw
dart
darts
dartboard
dartsi
eeecd
targetsi
sources
testcase
abbc
sourcesi
replacements
streak
mirrored
alone
0-59
pm
turnedon
1002
0-11
451
watch
leds
led
abaacc
xn-1
xn-2
turbulent
comparison
ants
plank
searchcost
gifts
bcdea
-numsi
ycentre
2d-map
xcentre
actuali
require
minimumi
busiest
i2th
loadi
busy
computational
handled
escaped
backslash
cardpoints
tiling
tilings
tromino
summing
finalsum
posx
determining
angle2
vision
obstruct
posy
printbar
printfoo
foobar
statusi
containedboxes
containedboxesi
initialboxes
kelvin
celsius
27315
3200
fahrenheit
watered
taps
one-dimensional
tap
k-repeating
801
243801
243803
243
803
bottoms
tops
topsi
bottomsi
bval
aval
ac
abcbabcbcb
baa
ababbc
agey
agex
expectedi
annual
starty
startx
x1i
x2i
y1i
specialroadsi
specialroads
y2i
52372
numsliri
arri-k
arr5
arr3
arr4
k-increasing
grades
reverses
zabcdefghijklmnopqrstuvwxyzabcdefghijklmnopqrstuvwxyzabcd
wraparound
deletefront
deletelast
mycirculardeque
mycirculardequeint
insertfront
insertlast
getrear
getfront
says
guessesj
lazy
non-obstacle
4-directional
walks
5489355421
5489355214
smallest-valued
5489355142
5489355241
care
5489355412
alex
xiyi
one-letter
xiyihere
ret
items2
items1
reti
poker
suits
suit
flush
suitsi
tape
qwertyuiop
asdfghjkl
zxcvbnm
american
patterni
dv
options
dva
nums2ik
nums1ik
nums1i1
nums1i0
minnums2i0
carpets
floori
numcarpets
solitaire
consisiting
recorddate
weather
yesterday
returnedarrayi
arraymap
atom
atomic
formulas
h2o2he3mg4
h2o2
h1o2
h2o23
h2o
chemical
colconditionsi
colconditions
rowconditionsi
rowconditions
belowi
abovei
k-diff
121000
102001
cae
bce
completion
luprefix
uploaded
upload
uploadint
luprefixint
uploads
subpath
arrlen
clipsi
sporting
lasted
clip
clips
refereeid
richest
wealth
accountsij
edits
edit
powerful
cherry
thorn
y0
trio
trios
encodes
powersj
classs
superclass
clumsy10
clumsy
factorial10
rects
rectsi
pleasing
beneath
three-letter
aesthetically
stacking
respecting
numst
sizet
resizing
dynamic
resize
designing
prison
vacant
bean
beans
indexs
unmarked
createcounter
non-repeating
gx
fghx
identity
hx
fnx
queryindicesi
queryindices
lengthsi
querycharactersi
querycharacters
precisely
deliveryid
customerprefdeliverydate
depthc
changeint
fills
numbercontainers
infrastructure
ath
list1s
bth
reindexing
4253
raised
mittal
d1
congratulate
remaps
remapping
sneakily
remap
326
d2
danny
weekly
shadow
planes
looking
3-dimensional
projection
projections
yz
zx
gregorian
sxy
accepterid
requesterid
requestaccepted
acceptdate
rightsumi
leftsumi
cyclically
3001
112
deci-binary
divisorsi
incurred
signals
traffic
groupby
arraygroupbyfn
routesi
routes0
grandparent
even-valued
s1s
ak
scoring
numarrows
bobarrows
bk
archery
alicearrows
shoots
floornumsi
mycalendarthree
k-booking
bring
arrbannedi
bannedi
ologarrlength
packages
package
ship
port
ideal
digitsi
upon
restrictionsi
egg
breaks
eggs
unbroken
certainty
reused
worddict
segmentation
empid
joined
1337
row-wise
walked
heads
linked-lists
correctly
ahead
realized
stationary
rests
datetime
directories
filedirectory
refers
tonight
professional
history
enddayi
startdayi
boxesi
100ms
30ms
60ms
cancelled
400ms
50ms
ty
tx
sy
sx
aalength
routine
235
indexes
till
population
million
fn-1
brings
forth
sessions
tic-tac-toe
maxdistance
filter
leftright
disconnect
past
entered
safe
protected
designated
tab
fruit
v1
v2
mode
movesi
gridrowicoli
exceeds
initialize
increased
listnode
saleid
companys
maxsum
published
cited
citations
papers
researcher
h-index
citationsi
researchers
removeint
extension
colsum
encodedi
fancy
completes
reduced
fleet
one-lane
speeds
collides
infinity
attending
dash
slice
cheese
decrements
comparing
performance
searchint
situation
faster
produces
cooldown
home
overlapped
single-space
traversed
cba
wordlength
newnums
newnumsi
k1
k2
yield
chalkboard
finite
const
supposed
groupsi
456
bash
121241510
2510
gains
incoming
projects
serving
latter
js
former
chef
rented
manages
insertstring
thrown
february
0190
maxsize
sake
worry
handling
drops
knights
applications
pairing
scoresi
rain
queryint
efficiently
pad
strongest
rods
collision
truck
important
things
eliminate
popular
views
transpose
aebdc
aeb
pj
linked-list
dominoesi
engineer
advance
tails
internally
abbreviated
reporting
computers
throughout
sea
compress
sudoku
sub-boxes
staying
searches
multi-dimensional
reformatted
searchstring
article
warm
comma
0001
molecule
borders
intersecting
forwards
modifications
deposit
depositint
withdrawint
withdraw
pizza
prints
printnumber
console
entry
logical
bug
fashion
ch
youre
sensitive
ipv4
compiler
java
numsl1
numsr-1
truncates
safely
self-edges
answerx
hexadecimal
locks
croaks
croak
croakoffrogs
printing
successors
s2j
text1
text2
targetgrid
solid
targetgridrowcol
sweltering
chalki
restart
chalk
mn
px
queuing
abcdefghijklmnop
arbitrarily
ab121p
cdefghijklmn
understand
lengthi
lengthj
cuboidsi
cuboids
cuboid
heightj
widthj
262124
zbax
odd-valued
endgene
8-character
startgene
investigate
mutations
gene
aaccggtt
aaccggta
mutation
sizei
absid
hotel
minsizej
preferredj
roomidi
firstname
addressid
lastname
orderings
top-to-bottom
rith
cith
flooded
enrolled
homogenous
develop
fails
isbadversionversion
versions
developed
sqrt
numzeroes
numzeros
numnegones
-1s
numones
buys
developer
pages
web
1-d
seq0
seq1
forwardbackward
numsseqj
seqk
blocksi
recolor
non-horizontal
references
ologm
159
numsinumslength
numsii
357
sub-nodes
sub-node
rootrightval
minrootleftval
222
225nullnull57
pressing
quest
spelled
fallout
stage
1200
freedom
purpose
anticlockwise
trail
engraved
keyword
door
super-palindromes
super-palindrome
lastdayi
coursesi
poisoned
timeseriesi
poison
hero
timeseries
timer
ashe
attacks
teemo
endtime1
starttime2
starttime1
endtime2
event1
event2
346
identifiers
digit-logs
identifier
letter-logs
space-delimited
lat
2015
holders
policyholders
policyholder
tiv2016
longitude
latitude
insurance
lon
2016
investment
tiv2015
policy
fooditemi
customernamei
header
tablenumberi
ordersicustomernameitablenumberifooditemi
wisely
getaveragetimestring
checkinint
stationname
getaveragetime
undergroundsystem
checkoutint
startstation
underground
railway
endstation
checkout
checkin
chronological
ratingj
soldier
ratingk
employeesisubordinates
employeesiid
employeesiimportance
upper2
bracketslength
percent0
upperi-1
percenti
bracketsi
upperi
upper0
earned
tax
percent1
taxed
taxes
upper1
percent2
airplane
graphical
consuming
trimi
kith
plates
plate
candle
candles
om
logn
logm
lenarr
encrypted
encryption
encrypterchar
encrypts
decryption
encrypter
encryptstring
encrypt
decryptstring
carried
righttolefti
regulate
righttoleftj
lefttorighti
putnewi
pickoldi
warehouses
lefttorightj
bridge
nummoves
busesi
passengersj
lo
tastiness
sells
touch
rec1
rec2
distance0
distance3
distance1
distance2
mailbox
mailboxes
falses
trues
answerkeyi
answerkey
truefalse
confuse
ts
maximizing
codes
wheels
deadends
wrap
floorpilesi
floorx
freqstack
stack-like
preserve
bn
minai
ti
maxcost
quantitiesi
specialty
retail
volatile
stockprice
worse
nature
correcting
machineid
processingtime
processid
lonely
cstart
northwest
rstart
grids
southeast
minn
rankp
answerrowcol
rankq
patientid
patients
diab1
diabetes
patientname
hospital
sqrt2
edgecosti
edgecost
shortestpathint
graphint
addedgeint
appearance
substituted
substitution
numpeople
gift
scramble
scrambled
mappingi
0144567
4567014
lowfats
fat
recyclable
sumnums0numsi
runningsumi
patches
addpatch
rand7
rand10
argument
cursorposition
cursorrightint
currenttextlength
addtextstring
min10
simulating
cursor
editor
cursorleftint
deletetextint
texteditor
guessing
minstack
getmin
retrieving
a123bc34d8ef34
maximumbit
2maximumbit
mat42
mat20
mat31
444
matchesi
loseri
defeated
winneri
parking
parkingsystemint
cartype
parkingsystem
medium
addcarint
park
inverting
-20
-23
-22
sentence1
sentence2
jane
my
10921
bitwise-and
mechanism
mainly
printthird
operating
imply
seem
printsecond
printfirst
comprehensiveness
maxlocalij
maxlocal
storekeeper
bbabba
bba
bababcba
hike
effort
hiker
columns-1
heightsrowcol
hope
rows-1
unidirectional
subgrids
legs
eyes
puppy
vehicle
numpassengersi
flowerbed
no-adjacent-flowers
fertile
bottommost
barren
farmer
pyramidal
apex
wednesday
friday
thursday
saturday
rights
voting
predict
ban
exercise
victory
parties
senators
dota2
radiant
senator
senate
round-based
dire
announce
prevcoursei
relationsi
semesters
nextcoursei
semester
childrens
evaluations
bottom-up
encounter
sentinel
934126
solutiondouble
randpoint
wiggle
abab
ccjjc
leavebob
business
leap
5-character
rome
arrivebob
mm-dd
arrivealice
leavealice
5678
1238
5674
permn
numspivot
minnumsi
12312
6060
1069
3600-second
70129
site
130189
tweetcountsrecordtweetrecordtweetrecordtweetgettweetcountsperfrequencygettweetcountsperfrequencyrecordtweetgettweetcountsperfrequency
gettweetcountsperfrequencystring
nullnullnullnull221null4
36107209
gettweetcountsperfrequency
tweetcounts
tweet3
analyzing
1010000
tweetcountsrecordtweettweet3
recordtweet
tweet30tweet360tweet310minutetweet3059minutetweet3060tweet3120hourtweet30210
analysis
059
tweetname
103609
721010000
tweetcountsgettweetcountsperfrequencyminute
60-second
frequencys
86400-second
997010000
0210
tweetcountsgettweetcountsperfrequencyhour
recordtweetstring
drinking
numbottles
bottles
drink
numexchange
bottle
axyz
querychar
streamchecker
detect
streamcheckerstring
xyz
abcabc
treenodeval
recovered
treenoderight
findelementstreenode
treenodeleft
treenodeleftval
findelements
recovers
treenoderightval
operationday
gainloss
stockname
exceptional
38
four-person
reservedseatsi
reservedseats
aisle
123450
101144
snailrowscount
250
colscount
751811
19171615
321220
rowscount
snail
transforms
iterating
organised
98613
uni-valued
necesssarily
comprised
specialin
specialij
needsi
offer
achievable
season
self-dividing
128
keypress
keyspressed
releasetimes0
releasetimes
keypresses
released
keyspressedi
releasetimesi
keypad
tester
homework
querytime
lays
ytarget
ghosts
ghost
escape
ghostsi
xtarget
pac-man
telephone
2-9
shiftt
shiftz
calculatemkaverage
mkaverage
addelementint
mkaverageint
summarize
getintervals
summary
summaryranges
seen
channel
patience
patiencei
resend
periodically
originating
resending
replies
channels
slant
isinfectedij
modeled
threatens
virus
isinfected
rapidly
quarantine
affected
careful
div
word0i
divi
arts
rats
similarity
tars
ordersi
backlog
ordersi1
ordertypei
orthogonal
illustrated
fntxt
fncontent
directorypathfilenametxt
f1txtf1content
f1content
fntxtfncontent
f2txt
f2content
f2txtf2content
rootd1d2dm
f1txt
grade
submitted
rewarded
elementary
math
eg
352
transactionid
visitid
mall
faces
arr1i-arr2j
end-nodes
followint
followeeid
followunfollow
posttweetint
getnewsfeedint
unfollowint
twitter
unfollowing
composes
posted
1-dimensional
110xxxxx
utf-8
0xxxxxxx
byte
translates
11110xxx
n-bytes
unicode
octet
bytes
-------------------------------------------------------------
1-byte
utf8
10xxxxxx
1110xxxx
ni
backspacing
editors
14234
12344
locationsj
locationslength
locationsi
repetitions
sub-sequence
rix-1
laps
lap
race
tire
tires
changetime
tiresi
numlaps
paragraph
imaginary
multiplications
complex
i2
-100
realimaginaryi
unfairness
cookiesi
stamped
left-most
stamp
targetlength
description
genre
boring
tilt
buried
underneath
excavate
c1i
mud
dig
r1i
artifacts
artifact
artifactsi
uncovered
c2i
r2i
digi
widthjheightj
widthiheighti
width-to-height
interchangeable
sandwich
lunch
sandwiches
sandwichesi
cafeteria
ramp
removable
sremovablei
removablelength
town
trust
rumor
secretly
trusts
trusti
oranges
kitchen
computation
ea
even-numbered
blacklist
blacklisted
kilograms
turnn
turn1
personname
combinationiterator
combinationlength
combinationiteratorstring
server-to-server
latin
consonant
applema
goat
oatgma
ma
made-up
nums2k
nums1i2
nums1k
minjump
maxjump
haystack
needle
indexdiff
valuediff
orient
ministry
transport
narrow
reorienting
fees
passingfeesj
passingfees
non-coprime
lcm
harmonious
anslength
rains
floods
lake
rainsi
dry
rainslength
incur
closes
2d-array
early
indiceslength
taped
xend
y-coordinates
stretches
xstart
y-direction
spherical
uniquely-sized
13254
xcnti
xcnti-1
maxmoves
cnti
subdivide
mistake
hashset
containskey
addkey
myhashset
1110
lockedi
meal
deliciousness
deliciousnessi
meals
studentsi
mentorsj
mentors
achieved
survey
mentor
compatibility
student-mentor
col1i
row1i
queryi
matxy
row2i
col2i
hole
grapha
graph1
min2
12335
instructionsi
1235
stonesj
second-largest
distinctly
third-largest
122
21347112918
18291174312
tracking
tracked
overlaps
removerangeint
rangemodule
queryrangeint
module
addrangeint
devices
beam
while1
activated
banki
beams
anti-theft
xored
secondi
secrets
firstperson
stuck
redirect
boards
redirects
productkey
pointerreference
deleteatindexint
addatheadint
indexth
addattailint
addatindexint
mylinkedlist
prev
fingers
unusuable
wordsjk
additive
03
numselect
cnumselect
1921681312
0011255245
012201
2582
3245
backs
backsi
fronts
frontsi
colrow
col1row1col2row2
rth
mutating
changenumi
24130
13024
bix
pointsj
countj
heshe
10101
morse
----
transformations
international
sleeps
millis
secondlen
firstlen
differenceij
wordsij1
differencei
equal-length
wordsij
type-2
type-1
columntitle
redistribute
maxheightsi1
heightsi2
heightsj
heightsj-1
minheightsi
nodei
parentsx
n-sided
triangulate
triangulation
016666666
nonrepeatingpart
016
016666
integerpart
212
repeatingpart
1230001
integerpartnonrepeatingpartrepeatingpart
integerpartnonrepeatingpart
conventionally
123001212
portion
gcdval1
validly
climbing
factoryj
roboti
factories
repairs
positionj
observation
fortunately
went
observations
presence
encodestring
shorturl
httptinyurlcom4e9iak
shortening
companion
tiny
longurl
encodedecode
httpsleetcodecomproblemsdesign-tinyurl
tinyurl
decodestring
most-significant-bit
least-significant-bit
i-2th
style
-14-13
mincurr
boardn
boustrophedon
destinations
-y
middleindex
numsmiddleindex2
numsmiddleindex-1
numsmiddleindex1
op2
op3
adhere
conventions
op1
negation
accommodate
unnecessary
inventory
weirdly
inventoryi
marbles
marble
weightsj
boats
boat
chemistry
skilli
is2
this1
sentence4
averagea
averagearr
averageb
mls
ml
soup
stampheight
stampwidth
enqueuetimei
processingtimei
act
spellsi
spells
potionsj
potion
potions
-123
mex
103
100th
glasses
excess
champagne
poured
pouring
pictured
prefixi
xvalue
mycalendartwo
2-mirror
base-k
base-2
contrary
base-10
k-mirror
trimming
typewriter
variance
searched
pangram
remainder
heavy
bulky
numsnumsk
numsnumsnumsk
ns
763
-55
-255
largest-valued
word1i
word1length
word2j
word2length
sortracker
invoked
addstring
invocation
attractiveness
scenic
querying
queried
tracker
gasi
circuit
erasures
erasure
hitsi
stable
explode
2i
labeling
listing
10-6
envelope
envelopes
envelopesi
doll
russian
repetitively
sentencesi
xzzy
zzxy
special-equivalent
xyzz
bobsizesj
alicesizes
alicesizesi
bobsizes
sessionid
sendmessage
activitydate
2019-07-27
scrolldown
endsession
opensession
hamster
hamsters
hamstersi
numsleft1
therere
entrancecol
entrancerow
maze
functionsi
resolves
promisepool
subjectname
studentname
attended
examinations
rowindex
rowindexth
cuisinesi
foodratings
ratingsi
foodratingsstring
changeratingstring
cuisines
cuisine
highestratedstring
highest-rated
foodsi
newrating
allocatorint
functionalities
allocateint
freed
allocator
freeint
capitalize
capitalized
allocates
maxrow
vary
ticketing
concert
hence
bookmyshowint
gatherint
scatterint
hall
bookmyshow
spectators
favoritecompaniesi
favorites
favoritecompanies
companies
carpet
dress
washing
dresses
mask
personal
---xxxx
--xxxx
0-3
10-13
asterisks
masked
somewhere
baaabb0
baaba0
150
cashbacki
autoincrement
minutestotest
consume
survive
pigs
minutestodie
poisonous
irregular
3d
glue
wear
hats
hatsi
src
dst
flightsi
4566701244
0124445667
gang
thieves
securityi
duty
exclusively
cornered
functionality
3k
statuses
frontmost
pushbackint
popping
frontmiddleback
popmiddle
popfront
pushfrontint
popback
pushmiddleint
mycircularqueue
benefits
enqueueint
dequeue
mycircularqueuek
non-alphanumeric
n-bit
gray
133
elapse
boomerangs
tuple
matters
nestedinteger
on2
shifted
uam
groceries
paying
getbillint
productsi
cashierint
productj
purchased
frequented
amountj
supermarket
cashier
subtotal
p4
p3
numsri
numsli1
numsli
lfucache
lfucacheint
invalidated
lfu
square-free
startindex
pillow
cheating
classroom
taller
tripletsj
tripletsi
maxbi
max3
max2
maxai
max5
maxci
bananas-per-hour
bananas
koko
loves
slowly
numsnumsi
zero-based
macros
implicit
control
comment
comments
newline
281825
3825
380925
88855
exhaust
rleiterator
exhausts
rle
rleiteratorint
exhausted
encodingi
detonate
felt
detonated
bombs
bombsi
abccdef
caaacab
licenseplate
insensitive
12c
cbca
isomorphic
nextcoursej
relationsj
prevcoursej
months
107
depart
trains
commute
up-left
mynumbers
subroot
treesj
columnnumber
interesting
aliceleetcodecom
emailsi
myemailcom
mails
filtered
forwarded
everything
alicezleetcodecom
mynameemailcom
assumes
truncating
beautifully
truthy
arrayfilter
functionidstart
1end2
0start3
endtimestamp
guard
obstructed
guardsi
wallsj
gt
entity
lt
apos
quot
frasl
ampersand
entities
amp
html
cbda
acbd
verifying
targetwords
startwords
arr1j
arr2i
harvest
depicts
strsn
strs0
strs1
strs2
closer
nameisageyearsold
knowledge
knowledgei
lasti
bookingsi
bookings
numsansi
circumvent
mountainarrgetindex
interactive
mountainarray
disqualification
mountainarrayget
mountainarraylength
submissions
mountainarr
mountainarraygetk
newprice
changedate
2019-08-16
fix
arri-1
countsi
requiring
pills
pill
workersj
pickup
pickupdelivery
pickupi
services
deliveryi
derivedi
original0
originali
cbad
numsendi
numsstarti
depth-first
dfs
prior
self-loops
sumregion
nummatrix
sumregionint
nummatrixint
altitude
biker
gaini
altitudes
explore
tenth
10th
theres
nums11
nums10
nums1n
nums20
nums21
nums2n
hiddeni
differencesi
refueling
startfuel
mile
fueli
transferring
refuel
countintervals
sex
tables
temporary
ocurrences
symmetric
mirror
3bb
well-formatted
aabc
-6
evalints
4a
alternates
3aab
breaking
-2aaa
-1a14
5c
evalvars
asterisk
salespersons
alongside
salesid
comid
commission
salesperson
hiredate
commissionrate
6174
61741
6141
6741
nextvisiti
nextvisit
purple
rhombus
biggest
depicted
gender
parsers
al
interpretation
interpret
flag
joins
primaryflag
homes
refuses
steals
capability
steal
robbed
dislikesi
dislikes
dislike
pixel
sr
sc
imagesrsc
imageij
doubled
keyname
2351
2251
2352
keytimei
emits
saves
alert
key-card
key-cards
keynamei
keycard
0949
one-hour
keytime
doors
wizards
ruler
strengthi
wizard
non-adjacent
halve
yllw
mistakes
yollow
errors
handles
checker
capitlization
yeellow
randomindex
brand
xrandom
lemonade
billsi
bills
collectively
511
buildingsi
skylines
geometric
silhouette
grounded
termination
512
x1y1x2y2
absolutely
leavetimei
capacitya
capacityb
cans
hisher
waters
alicebob
expensive
fence
enclosed
well-fenced
ans0
ans1
official
inspection
variety
001101
size1
size2
matchings
trainer
playersi
trainersj
trainers
left-out
alter
expressible
indexk
numsindex2
numsindex1
numsindexk
against
competes
compete
winners
firstplayer
secondplayer
fullfill
exceeded
result1
widths0
widths1
result0
permuting
greatness
nextlargest
priorities
tasksj
serversi
partnerids
partnerid
leadid
leadids
dailysales
dateid
makename
suggests
minimums
suggested
pickindex
sumw
075
wlength
snapshot
setindex
snap
array-like
getindex
snapid
snapshotarray
snapshotarrayint
mhts
minh
maxlen
46
acefh
rexpr
re1
grammar
abdfh
acdfg
rabbc
rw
rabcdefgh
understood
acefg
rabc
abefg
concatenations
rabcd
re2
abdfg
acadbcbd
ek
acdfh
comma-delimited
singleton
ra
abefh
matrixxy
crossed
obviously
additionalrocks
rocksi
rocks
capacityi
lifo
mystack
last-in-first-out
descriptionsi
islefti
childi
descriptions
movecostij
basic
equality
o2
isequal
tright
tleft
baseball
operationsi
queuej
queue0
hj
kj
answerij
matrc
numsdivide
timestampprev
setstring
time-based
getstring
timemap
k-sum
gave
throneinheritance
childname
kingname
successorx
getinheritanceorder
grandchildren
successorbob
successorking
throneinheritancestring
deathstring
birthstring
jack
whos
inheritance
successorxs
son
curorder
well-defined
oldest
parentname
born
successoralice
successorjack
cast
topvotedcandidateint
topvotedcandidate
qint
election
personsi
fib
factorialn
fibn
dacb
abdc
001112
0120
destroy
seeding
043
accountsi
accountsi0
voters
voter
position-one
truth
statements
statementsii
statementsij
crossword
lastly
constituent
dest
src1
src2
overwritten
inaccessible
getkey
setting
setkey
un-expired
84351
2314
click
clickr
revealing
clickc
minesweeper
char
abe
ors
accelerate
aar
ab-
ba-c
hyphen
-ab
hyphens
afad
chunked
shuffle
growtime
blooming
seeds
growtimei
blooms
growth
planttimei
bloomed
planttime
dfe
adc
def
renewed
authentication
generatestring
expiry
renewstring
expire
authenticationmanagerint
expires
authenticationmanager
renews
currenttime
timetolive
unexpired
tokenid
renew
countunexpiredtokens
countunexpiredtokensint
heap
nim
gi
greed
cookie
findsumpairsint
nums2index
findsumpairs
tot
commonly
resr1c2height-r-1
2height1
resrc
res0n-12
resr1c-2height-r-1
followers
follower
discovering
discovers
forget
extracandies
kid
kids
cbtinsertertreenode
getroot
cbtinserter
compact
e3
6e-1
-123456e789
314
--6
535e93
-90e3
95a54e53
1e
2e10
99e25
3e7
-01
1a
0089
heightmap
typesi
indistinguishable
counti
marksi
director
actorid
directorid
actordirector
cooperated
actor
primefactors
interprets
normalizes
81
0954
pushcost
finger
targetseconds
54
normalized
cooking
startat
microwave
fatigue
99
generic
7212
73412
stockspanner
quotes
todays
today
span
expectation
qualityi
wagei
wage
silver
scorei
athletes
medal
bronze
athlete
pattern1
pattern0
divisions
appearing
2019-01-01
saledate
2019-03-31
unitprice
mycalendar
desiredtotal
maxchoosableinteger
re-use
nodeleft
noderight
traverses
particularly
diffi
subtracted
pawns
pawn
captures
groupsizesi
groupsizes1
groupsizes
signfuncproduct
signfuncx
unfixint
compactly
bitset
tostring
fixint
bitsetint
coincide
requestat
client
canceled
cancellation
unbanned
role
2013-10-01
2013-10-03
clientid
cancelledbydriver
usersid
driverid
cityid
cancelledbyclient
interleaving
t3
tm
peekingiterator
peekingiteratoriteratorint
prize
prizepositionsi
prizes
prizepositions
unvisited
candytype
noticed
candytypei
advice
advised
doctor
schemes
participate
crimes
profitable
scheme
crime
commit
minprofit
participates
solutionlistnode
absarri
putting
hercy
ababb
datastream
consecint
datastreamint
myhashmap
hashmap
alal1ar
lr
sumnums1
sumarr
1121345
nums1leftright
nums2leftright
sumnums2
1112131415
11231415
shipped
belt
conveyor
maxvalue
namely
1351315
551
requestsj
resultj
chip
chips
decoding
operands
revx
revnumsj
rev120
rev123
revnumsi
12321
stars
non-star
punishment
flowersi
newflowers
caretaker
bx1
ay1
ax1
bx2
ax2
by1
rectilinear
by2
ay2
supervisor
totals
256
version1
2533
revision
revisions
version2
bulb
toggle
firstword
secondword
targetword
021
n-digits
librarys
fish
fisher
sep
jun
2100
31st
yyyy
nov
1900
dd
jan
dec
feb
mar
jul
30th
apr
aug
oct
column-wise
evil
concatenates
golf
maxnumsj
mi
uniques
index-0
heada
retain
headb
skipa
intersectval
intersected
lista
listb
skipb
operationsi1
operationsi0
accountid
monthly
20000
50000
myqueue
dependent
difficulties
jobdifficultyi
jobdifficulty
schedule
seperate
wrote
1412
14312
suffixes
gravity
inertia
side-view
boxs
requested
timeout
signups
confirmation
expired
signup
confirmed
confirming
confirmations
arraylast
3-1-5-9
13579
7777
separator
thousands
handy
reshape
reshaped
row-traversing
wanted
matlab
horizontalcutsi
verticalcuts
cake
horizontalcuts
verticalcutsj
candidate
rungs
rung
unix-style
canonical
slashes
meanwhile
exempted
smooth
descent
progression
representative
representatives
eetcode
delightful
exercises
soul
sound
cool
warrior
universal
wrr
createhelloworld
reformatting
firstly
formatting
segmented
toggling
salaryi
deliver
ports
delivered
storage
maxweight
portsi
maxboxes
delivering
portscount
loaded
35ms
debounced
95ms
recieve
150ms
135ms
debounce
digital
introduced
rollmax
simulator
rollmaxi
constructai
constructa0
constructa
constructb
32-bits
01101
uni-value
153
havent
2m
maxm
jug2capacity
jug
jugs
pour
measurable
targetcapacity
measure
jug1capacity
arrrighti
arrlefti
advantage
pickint
25000000
countries
gdp
twenty-five
continent
km2
3000000
bigint
2d-plane
clock-wise
arrkn
arrk0
fk
arrk1
ps
losers
nums3k
nums4
nums4l
sessiontime
opsi
mxy
ops
hoursbefore
skipping
skips
letting
kmh
strs0strs0length
strs1strs1length
strs01
strs11
strs00
strs10
subtext1
subtextk
subtexti
subtext2
veganfriendlyi
maxprice
restaurantsi
filters
veganfriendly
landed
sidelengthi
freezes
brushing
database
poorquerypercentage
queryname
inform
managerheadid
informtimei
subordination
headid
manageri
urgent
k-similar
r-1
c-1
prefix-aligned
flipsi
endj
secondlistj
secondlist
firstlist
firstlisti
inversions
global
012345
checking
peculiar
permuted
organized
4-length
forested
m-1
hectare
hectares
four-directionally
areas
youtubecom
clears
browserhistoryvisitvisitvisitbackbackforwardvisitforwardbackback
browserhistoryvisitlinkedincom
backint
browserhistoryvisitgooglecom
linkedincom
browserhistoryforward2
forwardint
googlecom
leetcodecomgooglecomfacebookcomyoutubecom111linkedincom227
facebookcom
urllength
browserhistoryback1
visitstring
forwarding
browserhistoryforward1
browserhistory
browserhistoryleetcodecom
homepagelength
browserhistoryvisitfacebookcom
browserhistoryback7
5000
browserhistoryback2
browserhistorystring
browserhistoryvisityoutubecom
nullnullnullnullfacebookcomgooglecomfacebookcomnulllinkedincomgooglecomleetcodecom
homepage
basket2
minbasket1ibasket2j
basket1
92
93
329
new1
new2
2932
maxdoubles
furthest
hi1
ladders
rolling
sided
highest-ranked
pricing
cost2
pen
utensil
pencils
pens
cost1
pencil
overwrite
throttle
throttled
80ms
40ms
forgotten
adjacentpairs
adjacentpairsi
repeatlimitedstring
minalength
repeatlimit
prefi
surprisingly
alien
scope
mult
en
syntax
scopes
expr
lisp-like
vn
occurred
modes
8-directionally
sits
examroomint
leaveint
examroom
countuniquecharst
countuniquecharss
125
lru
lrucache
